---
title: MEPNetworkSegmentId
classe: Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# MEPNetworkSegmentId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId ElementId { get; set; }` | `mEPNetworkSegmentId.ElementId` | ElementId |
| `Boolean IsValidObject { get; }` | `mEPNetworkSegmentId.IsValidObject` | Boolean |
| `Int32 SegmentId { get; set; }` | `mEPNetworkSegmentId.SegmentId` | Int32 |
| `Void Dispose()` | `mEPNetworkSegmentId.Dispose()` | Void |
| `Boolean IsValid()` | `mEPNetworkSegmentId.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```